artillery.yml
config:
  target: 'http://localhost:3000'
  phases:
    - duration: 60
      arrivalRate: 20
scenarios:
  - flow:
      - post:
          url: "/todos"
          json:
            title: "task 1"
            description: "Description of Task 1"
            completed: "boolean"
            created_at: null